;; ************************************************************************************
;; OneLocale_Dialog-template.lang
;; save this file as UTF-16 w/ BOM (Byte Order Mark)
;; (a .lang file IS a type of .ini file, but w/ possibly different text editor defaults)
;; • you may translate these user-interface values to the language of your choice
;;   (save with a new language code)
;; ******************************************************
[general]
lang_id     = en
lang_name   = English
app_name    =
description =
translator  =
date        =
comment     =

[dialog_lang]
title       = Change Language
lbl_lang    = User Interface Language:
lbl_buttons = App will restart if you change Language\n(work in progress will be lost)
btn_OK      = OK
btn_Cancel  = Cancel

[tooltips_dialog_lang]
lang_list = Set User Interface Language

[errors]
OneLocaleDlg_ini_write_error    = Could not write to configuration file\n %path%
OneLocaleDlg_lang_not_found     = 'Language' entry in .INI file \n '%ini_path%' \n not found
OneLocaleDlg_newname_not_found  = Unexpected error: Language file not found for '%newname%'.


